#Алгоритм - любой порядок действий с чётко описанными шагами и ожиданием определенного результата

#Линейный алгоритм - описание действий, которые выполняются однократно в заданном порядке

#Циклический алгоритм - описание действий, которые должны выполняться указанное число раз или пока не выполнено условие

#Разветвляющий алгоритм - алгоритм, в котором в зависимости от условия выполняется либо одна, либо другая последовательность действий

#Вспомогательный алгоритм - можно использовать в других алгоритмах, указав его имя

